<template>
  <div class="users_content">
   <table class="users_data" width="100%">
      <thead>
          <tr>
               <th>إسم المستخدم</th>
               <th>زمن النشر</th>
               <th>النص</th>
               <th>الاجراء</th>
         </tr>
      </thead>
      <tbody>
         <tr v-for="(item, index) in lights" :key="index" >
            <td>{{item.name}}</td>
            <td>
              {{ item.date }} - {{ item.time }}
            </td>
            <td>
               {{ item.content }}
            </td>
            <td>
               <button class="btn_delete transition" @click="Deletelight(index)">
                  <i class="far fa-trash-alt"></i>
               </button>
            </td>
         </tr>
      </tbody>
   </table>
   </div>
</template>

<script>
   export default {
      data() {
         return {
            lights:[
               {
                  name: 'محمد الصوفي',
                  date: '6 فبراير 2021',
                  time: '6:00 مساءًا',
                  content: 'عن أبي هريرة رضي الله عنه أنّه قال: (أنَّ رَسولَ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ ذَكَرَ يَومَ الجُمُعَةِ، فَقالَ: فيه سَاعَةٌ، لا يُوَافِقُهَا عَبْدٌ مُسْلِمٌ، وهو قَائِمٌ يُصَلِّي، يَسْأَلُ اللَّهَ تَعَالَى شيئًا، إلَّا أعْطَاهُ إيَّاهُ وأَشَارَ بيَدِهِ يُقَلِّلُهَا)'
               },
               {
                  name: 'محمد الصوفي',
                  date: '6 فبراير 2021',
                  time: '6:00 مساءًا',
                  content: 'في شهر رجب يَفِدُ بعض الناس إلى المدينة النبوية المنورة بزيارتها بزيارة يسمونها الرَّجَبِية ، يرون أنها من السُّنن ، وهذه الزيارة المسماة بالرَّجَبِيةِ ليس لها أصل في كلام أهل العلم ، ولا ريب أن المسجد النبوي تُشَدُّ إليه الرحال في كل وقت وحين ، لكن تخصيصُ شهر معين أو يوم معين لهذا العمل يحتاج إلى دليل خاص ، ولا دليلَ هنا على تخصيصِ رجب بذلك ، وعلى هذا فاتخاذ هذا سنة يُتقَرَّبُ بها إلى الله في هذا الشهر بخصوصه أمر محدث ليس عليه دليل في الشريعة.'
               },
               {
                  name: 'محمد الصوفي',
                  date: '6 فبراير 2021',
                  time: '6:00 مساءًا',
                  content: 'حقيقة اتباع النبي صلى الله عليه وسلم هي التمسك بسنته فِعلاً فيما فعل، وتركًا فيما تَرك ؛ فمن زاد عليها أو نقص منها ، فقد نقصَ حظُّه من المتابعة بحسب ذلك ، لكن الزيادة أعظم ؛ لأنها تقدم بين يدي الله ورسوله صلى الله عليه وسلم والله تعالى يقول: ﴿ يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تُقَدِّمُوا بَيْنَ يَدَيِ اللَّهِ وَرَسُولِهِ وَاتَّقُوا اللَّهَ إِنَّ اللَّهَ سَمِيعٌ عَلِيمٌ ﴾ [الحجرات : 1]'
               },
               {
                  name: 'محمد الصوفي',
                  date: '6 فبراير 2021',
                  time: '6:00 مساءًا',
                  content: 'عن أبي هريرة رضي الله عنه أنّه قال: (أنَّ رَسولَ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ ذَكَرَ يَومَ الجُمُعَةِ، فَقالَ: فيه سَاعَةٌ، لا يُوَافِقُهَا عَبْدٌ مُسْلِمٌ، وهو قَائِمٌ يُصَلِّي، يَسْأَلُ اللَّهَ تَعَالَى شيئًا، إلَّا أعْطَاهُ إيَّاهُ وأَشَارَ بيَدِهِ يُقَلِّلُهَا)'
               },
               {
                  name: 'محمد الصوفي',
                  date: '6 فبراير 2021',
                  time: '6:00 مساءًا',
                  content: 'في شهر رجب يَفِدُ بعض الناس إلى المدينة النبوية المنورة بزيارتها بزيارة يسمونها الرَّجَبِية ، يرون أنها من السُّنن ، وهذه الزيارة المسماة بالرَّجَبِيةِ ليس لها أصل في كلام أهل العلم ، ولا ريب أن المسجد النبوي تُشَدُّ إليه الرحال في كل وقت وحين ، لكن تخصيصُ شهر معين أو يوم معين لهذا العمل يحتاج إلى دليل خاص ، ولا دليلَ هنا على تخصيصِ رجب بذلك ، وعلى هذا فاتخاذ هذا سنة يُتقَرَّبُ بها إلى الله في هذا الشهر بخصوصه أمر محدث ليس عليه دليل في الشريعة.'
               },
               {
                  name: 'محمد الصوفي',
                  date: '6 فبراير 2021',
                  time: '6:00 مساءًا',
                  content: 'حقيقة اتباع النبي صلى الله عليه وسلم هي التمسك بسنته فِعلاً فيما فعل، وتركًا فيما تَرك ؛ فمن زاد عليها أو نقص منها ، فقد نقصَ حظُّه من المتابعة بحسب ذلك ، لكن الزيادة أعظم ؛ لأنها تقدم بين يدي الله ورسوله صلى الله عليه وسلم والله تعالى يقول: ﴿ يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تُقَدِّمُوا بَيْنَ يَدَيِ اللَّهِ وَرَسُولِهِ وَاتَّقُوا اللَّهَ إِنَّ اللَّهَ سَمِيعٌ عَلِيمٌ ﴾ [الحجرات : 1]'
               },
               
            ]
         }
      },
      methods: {
         Deletelight(id){
            return this.lights.splice(id , 1);
         }
      },
   }
</script>

<style lang="scss" scoped>
.users_content{
   padding: 10px;
   width: 100%;
}
.users_data{
   position: relative;
   display: table;
   height: auto;
   background-color: #fff;
   border-collapse: collapse;
   border-spacing: 0;
   th{
      background-color: #1b5fdf;
      color: #fff;
      font-weight: 500;
   }
   th , td{
      padding: 10px;
      text-align: center;
      text-align: -webkit-center;
      border-left: 1px solid #bbbbbb;
         &:last-child{
            border-left: 0;
         }
         a{
            color: #1b5fdf;
            text-decoration: none;
         }
   }
  
   tr{
      &:nth-child(even){
         background-color: #f1f1f1;
      }
      .btn_delete{
      padding: 5px 10px;
      border-radius: 5px;
      color: #e11d74;
      cursor: pointer;
      border: none;
      line-height: 1.5;
      background-color: #e11d7450;
      
   }
   
   }
}
</style>